Tekla Open API Reference for Tekla Structures 2025
DistanceList.ToString Method (String, IFormatProvider)
 Returns the string representation of the distance list.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ToString(
	string format,
	IFormatProvider formatProvider
)
Public Function ToString (
	format As String,
	formatProvider As IFormatProvider
) As String
Parameters
format
Type: System.String
The format string.
formatProvider
Type: System.IFormatProvider
The format provider.
Return Value
Type: String
The string representation of the distance list.
Implements
IFormattable.ToString(String, IFormatProvider)
Examples
 This example shows how to override the number format and the format provider when formatting a DistanceList instance. The Tekla Structures convention is to use a dot as the decimal separator in all locales.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
       public void Example1()
       {
           // Current unit type controls the default unit type used in formatting.
           // The default unit is millimeter.
           Distance.CurrentUnitType = Distance.UnitType.Millimeter;
           // UseFractionalFormat controls whether the feet and inches are formatted
           // using the fractional representation. The default value is false which
           // causes the feet and inches to be represented as decimal numbers.
           Distance.UseFractionalFormat = false;
           // UseUnitsInDecimalString controls whether the unit type is shown in the
           // decimal string representation. The default is false.
           Distance.UseUnitsInDecimalString = false;
           // We'll use this distance list to demonstrate the formatting.
           DistanceList distanceList = new DistanceList(new Distance[]
                                                       {
                                                           new Distance(30.2),
                                                           new Distance(30.2),
                                                           new Distance(30.2),
                                                           new Distance(50),
                                                           new Distance(2.3),
                                                           new Distance(2.3),
                                                       });
           // Tekla Structures uses dot as the decimal separator in all locales.
           string TeklaStructuresFormat = distanceList.ToString(null, CultureInfo.InvariantCulture);
           // We can use the number format string to specify the precision. In this case, we use two decimal places.
           string TeklaStructuresFormatWithPrecicion = distanceList.ToString("0.00", CultureInfo.InvariantCulture);
       }
}
See Also
Reference
DistanceList Structure
ToString Overload
Tekla.Structures.Datatype Namespace